In [11]:
import pandas as pd
df = pd.read_csv('book1.csv')
print(df)

       name  class  roll no
0      ashu     12        3
1  himanshu     11        4
2    chetan     13        5

In [15]:
print(df['roll no'].dtype)

int64

In [16]:
df.head()

       name  class  roll no
0      ashu     12        3
1  himanshu     11        4
2    chetan     13        5

In [17]:
df.tail()

       name  class  roll no
0      ashu     12        3
1  himanshu     11        4
2    chetan     13        5

In [21]:
print(df['class'].dtype)

int64